---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyUInt64
source: html/8d3655d9-9a26-b932-90f2-9819143c03bf.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyUInt64

Represents a property of UInt64 value.

## Syntax (C#)
```csharp
public class AssetPropertyUInt64 : AssetProperty
```